<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"8bd3206e5c22c7824a45e18beb1e82812c6b907e4e0a0beb828515fedefc92cd","plan_job_ref":"Job Create MPE Management terraform plan #23 at https://github.com/AFMPE/mpe_management/actions/runs/7291736211","plan_hash":"4a437e1c90ab2eea9b5b940dfc972a307905593175c10bd643f5a7b5163b03fd","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_shared_keyvault[0].data.azurerm_private_endpoint_connection.pip[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_endpoint_connection" "pip" {
      + id                         = (known after apply)
      + location                   = (known after apply)
      + name                       = "ampe-eus-shared-keys-dev-private-endpoint"
      + network_interface          = (known after apply)
      + private_service_connection = (known after apply)
      + resource_group_name        = "ampe-eus-devsecops-dev-rg"
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault.keyvault[0] will be updated in-place
  ~ resource "azurerm_key_vault" "keyvault" {
        id                              = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-dev-rg/providers/Microsoft.KeyVault/vaults/ampe-eus-shared-keys-dev"
        name                            = "ampe-eus-shared-keys-dev"
        tags                            = {
            "deployedBy"  = "AzureNoOpsTF"
            "environment" = "public"
            "workload"    = "shared-keys"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              - "108.4.77.230/32",
              + "108.4.77.230",
              + "20.55.15.20/32",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.mod_shared_keyvault[0].azurerm_key_vault_secret.keys["vmpassword"] will be created
  + resource "azurerm_key_vault_secret" "keys" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "vmpassword"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mod_shared_keyvault[0].azurerm_private_dns_a_record.a_rec[0] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "a_rec" {
        id                  = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-devsecops-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/A/ampe-eus-shared-keys-dev"
        name                = "ampe-eus-shared-keys-dev"
      ~ records             = [
          - "10.8.7.100",
        ] -> (known after apply)
        tags                = {}
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #23](https://github.com/AFMPE/mpe_management/actions/runs/7291736211)